IDENTIFICATION DIVISION.
PROGRAM-ID. FIBONACCI.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 FIBONACCI-NUMBERS.
   05 PREV-NUM        PIC 9(3) VALUE 0.
   05 CURR-NUM        PIC 9(3) VALUE 1.
   05 NEXT-NUM        PIC 9(3) VALUE 1.
01 END-OF-PROGRAM     PIC X(3) VALUE 'NO '.

PROCEDURE DIVISION.
PERFORM UNTIL END-OF-PROGRAM = 'YES'
   DISPLAY CURR-NUM
   COMPUTE NEXT-NUM = PREV-NUM + CURR-NUM
   MOVE CURR-NUM TO PREV-NUM
   MOVE NEXT-NUM TO CURR-NUM
   IF CURR-NUM > 100 THEN
      MOVE 'YES' TO END-OF-PROGRAM
   END-IF
END-PERFORM.

STOP RUN.